Tekla Open API Reference for Tekla Structures 2025
InputItem.InputTypeEnum Enumeration
 Defines the type of the input.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum InputTypeEnum
Public Enumeration InputTypeEnum
Members
Member name | Value | Description
INPUT_1_POINT | 0 |  The input is one point. The data is returned as a point.
INPUT_2_POINTS | 1 |  The input is two points. The data is returned as an array list of points.
INPUT_POLYGON | 2 |  The input is any number of points (a polygon). The data is returned as an array list of points.
INPUT_1_OBJECT | 3 |  The input is one model object. The data is returned as a model object.
INPUT_N_OBJECTS | 4 |  The input is any number of model objects. The data is returned as an array list of model objects.
See Also
Reference
Tekla.Structures.Model Namespace